原文地址：

[https://www.boost.org/doc/libs/](https://www.boost.org/doc/libs/)

Accumulators

一个关于增量计算和统计累加器的收集的框架。

Algorithm

一些有用的通用算法的集合。

Align

内存对齐函数，分配器和(traits)特征。

Any

用于单个值不同值类型的的安全通用的容器。

Array

符合STL标准的容器包装器，用于恒定大小的数组。

Asio

便携式网络和其他低级I / O，包括套接字，定时器，主机名解析，套接字流，串行端口，文件描述符和窗口句柄。

Assert

可自定义的断言宏。

Assign

使用常量或生成的数据填充容器从未如此简单。

Atomic

C ++ 11风格的原子

Beast

仅使用C ++ 11和Boost.Asio的便携HTTP，WebSocket和网络操作

Bimap

C ++的双向映射库。使用Boost.Bimap，您可以创建关联容器，其中的两种类型都可以用作键。

Bind

boost :: bind是标准函数std :: bind1st和std :: bind2nd的泛化。它支持任意函数对象，函数，函数指针和成员函数指针，并且能够将任何参数绑定到特定值或将输入参数路由到任意位置。

Call Traits

定义传递参数的类型。

CallableTraits

作为Boost.FunctionTypes的虚继承者，Boost.CallableTraits是一个仅限标头的C ++ 11库，用于编译时检查和操作所有“可调用”类型。对C ++ 17功能的额外支持。

Chrono

有用的时间工具。C ++ 11。

Circular Buffer

符合STL的容器，也称为环形或循环缓冲区。

Compatibility

帮助不符合标准的库。

Compressed Pair

空成员优化。

Compute

并行/ GPU计算库

Concept Check

通用编程工具。

Config

帮助Boost库开发人员适应编译器的特性;不适合库用户。

Container

标准库容器和扩展。

Container Hash

与STL兼容的哈希函数对象，可以扩展为哈希用户定义的类型。

Context

（C ++ 11）上下文切换库。

Contract

C ++的契约编程。支持所有契约编程功能：转包，类不变量，后置条件（具有旧值和返回值），前置条件，断言失败时可自定义的操作（例如，终止或抛出），可选的编译和断言检查等。

Conversion

多态转换。

Convert

可扩展和可配置的类型转换框架。

Core

具有最小依赖性的简单核心实用程序的集合。

Coroutine

协程库.

Coroutine2

(C++11) 协程库.

CRC

Boost CRC库提供CRC（循环冗余码）计算对象的两种实现和CRC计算功能的两种实现。这些实现是基于模板的。

Date Time

一组基于通用编程概念的日期时间库。

DLL

Library for comfortable work with DLL and DSO.

用于适配于DLL和DSO的库。

Dynamic Bitset

dynamic\_bitset类表示一组位。它通过运算符\[\]提供对各个位值的访问，并提供可以应用于内置整数的所有按位运算符，例如运算符和运算符。和运算符＆lt;＆lt;集合中的位数在运行时通过dynamic\_bitset的构造函数的参数指定。

Enable If

选择性包含函数模板重载。

Endian

用于正确字节排序的类型和转换函数以及更多，无论处理器字节顺序如何。

Exception

Boost Exception库支持在异常对象中传输任意数据，以及在线程之间传输异常。

Fiber

(C++11) 用户态线程库。

Filesystem

Boost Filesystem Library提供了便携式工具来查询和操作路径，文件和目录。

Flyweight

一种用来管理大量高度冗余的对象的设计模式。

Foreach

在C ++中，编写循环遍历序列的循环是单调乏味的。我们可以使用迭代器，这需要相当数量的样板，或者我们可以使用std :: for\_each（）算法并将我们的循环体移动到谓词中，这需要不少的锅炉板并迫使我们移动我们的远离它将被使用的逻辑。相比之下，其他一些语言，如Perl，提供了一个专用的“foreach”结构，可以自动执行此过程。BOOST\_FOREACH就是这样的C ++构造。它为我们迭代序列，使我们不必直接处理迭代器或编写谓词。

Format

格式库提供了一种类型安全机制，用于根据类似printf的格式字符串格式化参数。

Function

延迟调用或回调的函数对象包装器。

Function Types

Boost.FunctionTypes提供了对函数，函数指针，函数引用和指向成员类型的指针进行分类，分解和合成的功能。

Functional

Boost.Function库包含一系列类模板，它们是函数对象包装器。

Functional/Factory

用于动态和静态对象创建的函数对象模板

Functional/Forward

适配器允许泛型函数对象接受任意参数

Functional/Overloaded Function

将不同的函数重载到单个函数对象中。

Fusion

用于处理元组的库，包括各种容器，算法等。

Geometry

Boost.Geometry库提供几何算法，基元和空间索引。

GIL

通用图像库

Graph

BGL图形界面和图形组件是通用的，与标准模板库（STL）具有相同的意义。

GraphParallel

PBGL图形界面和图形组件是通用的，与标准模板库（STL）具有相同的意义。

Hana

一个现代的C ++元编程库。它提供了高级算法来处理异构序列，允许使用自然语法编写类型级计算，提供内省用户定义类型的工具等等。

Heap

优先级队列数据结构。

HOF

C ++的高阶函数

ICL

间隔容器库，间隔集和映射以及关联值的聚合

Identity Type

Wrap types within round parenthesis so they can always be passed as macro parameters.

In Place Factory, Typed In Place Factory

Generic in-place construction of contained objects with a variadic argument-list.

Integer

The organization of boost integer headers and classes is designed to take advantage of &lt;stdint.h&gt; types from the 1999 C standard without resorting to undefined behavior in terms of the 1998 C++ standard. The header &lt;boost/cstdint.hpp&gt; makes the standard integer types safely available in namespace boost without placing any names in namespace std.

Interprocess

Shared memory, memory mapped files, process-shared mutexes, condition variables, containers and allocators.

Interval

Extends the usual arithmetic functions to mathematical intervals.

Intrusive

Intrusive containers and algorithms.

IO State Savers

The I/O sub-library of Boost helps segregate the large number of Boost headers. This sub-library should contain various items to use with/for the standard I/O library.

Iostreams

Boost.IOStreams provides a framework for defining streams, stream buffers and i/o filters.

Iterator

The Boost Iterator Library contains two parts. The first is a system of concepts which extend the C++ standard iterator requirements. The second is a framework of components for building iterators based on these extended concepts and includes several useful iterator adaptors.

Lambda

Define small unnamed function objects at the actual call site, and more.

Lexical Cast

General literal text conversions, such as an int represented a string, or vice-versa.

Local Function

Program functions locally, within other functions, directly within the scope where they are needed.

Locale

Provide localization and Unicode handling tools for C++.

Lockfree

Lockfree data structures.

Log

Logging library.

Math

Boost.Math includes several contributions in the domain of mathematics: The Greatest Common Divisor and Least Common Multiple library provides run-time and compile-time evaluation of the greatest common divisor (GCD) or least common multiple (LCM) of two integers. The Special Functions library currently provides eight templated special functions, in namespace boost. The Complex Number Inverse Trigonometric Functions are the inverses of trigonometric functions currently present in the C++ standard. Quaternions are a relative of complex numbers often used to parameterise rotations in three dimentional space. Octonions, like quaternions, are a relative of complex numbers.

Math Common Factor

Greatest common divisor and least common multiple.

Math Octonion

Octonions.

Math Quaternion

Quaternions.

Math/Special Functions

A wide selection of mathematical special functions.

Math/Statistical Distributions

A wide selection of univariate statistical distributions and functions that operate on them.

Member Function

Generalized binders for function/object/pointers and member functions.

Meta State Machine

A very high-performance library for expressive UML2 finite state machines.

Metaparse

A library for generating compile time parsers parsing embedded DSL code as part of the C++ compilation process

Min-Max

Standard library extensions for simultaneous min/max and min/max element computations.

Move

Portable move semantics for C++03 and C++11 compilers.

Mp11

A C++11 metaprogramming library.

MPI

Message Passing Interface library, for use in distributed-memory parallel application programming.

MPL

The Boost.MPL library is a general-purpose, high-level C++ template metaprogramming framework of compile-time algorithms, sequences and metafunctions. It provides a conceptual foundation and an extensive set of powerful and coherent tools that make doing explict metaprogramming in C++ as easy and enjoyable as possible within the current language.

Multi-Array

Boost.MultiArray provides a generic N-dimensional array concept definition and common implementations of that interface.

Multi-Index

The Boost Multi-index Containers Library provides a class template named multi\_index\_container which enables the construction of containers maintaining one or more indices with different sorting and access semantics.

Multiprecision

Extended precision arithmetic types for floating point, integer andrational arithmetic.

Numeric Conversion

Optimized Policy-based Numeric Conversions.

Odeint

Solving ordinary differential equations.

Operators

Templates ease arithmetic classes and iterators.

Optional

A value-semantic, type-safe wrapper for representing 'optional' (or 'nullable') objects of a given type. An optional object may or may not contain a value of the underlying type.

Parameter

Boost.Parameter Library - Write functions that accept arguments by name.

Phoenix

Define small unnamed function objects at the actual call site, and more.

Pointer Container

Containers for storing heap-allocated polymorphic objects to ease OO-programming.

PolyCollection

Fast containers of polymorphic objects.

Polygon

Voronoi diagram construction and booleans/clipping, resizing/offsetting and more for planar polygons with integral coordinates.

Pool

Memory pool management.

Predef

This library defines a set of compiler, architecture, operating system, library, and other version numbers from the information it can gather of C, C++, Objective C, and Objective C++ predefined macros or those defined in generally available headers.

Preprocessor

Preprocessor metaprogramming tools including repetition and recursion.

Process

Library to create processes in a portable way.

Program Options

The program\_options library allows program developers to obtain program options, that is (name, value) pairs from the user, via conventional methods such as command line and config file.

Property Map

Concepts defining interfaces which map key objects to value objects.

Property Tree

A tree data structure especially suited to storing configuration data.

Proto

Expression template library and compiler construction toolkit for domain-specific embedded languages.

Python

The Boost Python Library is a framework for interfacing Python and C++. It allows you to quickly and seamlessly expose C++ classes functions and objects to Python, and vice-versa, using no special tools -- just your C++ compiler.

QVM

Boost QVM is a generic library for working with quaternions, vectors and matrices of static size with the emphasis on 2, 3 and 4-dimensional operations needed in graphics, video games and simulation applications.

Random

A complete system for random number generation.

Range

A new infrastructure for generic algorithms that builds on top of the new iterator concepts.

Ratio

Compile time rational arithmetic. C++11.

Rational

A rational number class.

Ref

A utility library for passing references to generic functions.

Regex

Regular expression library.

Result Of

Determines the type of a function call expression.

Scope Exit

Execute arbitrary code at scope exit.

Serialization

Serialization for persistence and marshalling.

Signals

Managed signals &amp; slots callback implementation.

Signals2

Managed signals &amp; slots callback implementation (thread-safe version 2).

Smart Ptr

Smart pointer class templates.

Sort

High-performance templated sort functions.

Spirit

LL parser framework represents parsers directly as EBNF grammars in inlined C++.

Stacktrace

Gather, store, copy and print backtraces.

Statechart

Boost.Statechart - Arbitrarily complex finite state machines can be implemented in easily readable and maintainable C++ code.

Static Assert

Static assertions (compile time assertions).

String Algo

String algorithms library.

Swap

Enhanced generic swap function.

System

Operating system support, including the diagnostics support that will be part of the C++0x standard library.

Test

Support for simple program testing, full unit testing, and for program execution monitoring.

Thread

Portable C++ multi-threading. C++11, C++14.

ThrowException

A common infrastructure for throwing exceptions from Boost libraries.

Timer

Event timer, progress timer, and progress display classes.

Tokenizer

Break of a string or other character sequence into a series of tokens.

Tribool

3-state boolean type library.

TTI

Type Traits Introspection library.

Tuple

Ease definition of functions returning multiple values, and more.

Type Erasure

Runtime polymorphism based on concepts.

Type Index

Runtime/Compile time copyable type info.

Type Traits

Templates for fundamental properties of types.

Typeof

Typeof operator emulation.

uBLAS

uBLAS provides matrix and vector classes as well as basic linear algebra routines. Several dense, packed and sparse storage schemes are supported.

Units

Zero-overhead dimensional analysis and unit/quantity manipulation and conversion.

Unordered

Unordered associative containers.

Utility

Class noncopyable plus checked\_delete(), checked\_array\_delete(), next(), prior() function templates, plus base-from-member idiom.

Uuid

A universally unique identifier.

Value Initialized

Wrapper for uniform-syntax value initialization, based on the original idea of David Abrahams.

Variant

Safe, generic, stack-based discriminated union container.

VMD

Variadic Macro Data library.

Wave

The Boost.Wave library is a Standards conformant, and highly configurable implementation of the mandated C99/C++ preprocessor functionality packed behind an easy to use iterator interface.

Xpressive

Regular expressions that can be written as strings or as expression templates, and which can refer to each other and themselves recursively with the power of context-free grammars.

YAP

An expression template library for C++14 and later.

TR1

Array

STL compliant container wrapper for arrays of constant size.

Bind

boost::bind is a generalization of the standard functions std::bind1st and std::bind2nd. It supports arbitrary function objects, functions, function pointers, and member function pointers, and is able to bind any argument to a specific value or route input arguments into arbitrary positions.

Container Hash

An STL-compatible hash function object that can be extended to hash user defined types.

Function

Function object wrappers for deferred calls or callbacks.

Member Function

Generalized binders for function/object/pointers and member functions.

Random

A complete system for random number generation.

Ref

A utility library for passing references to generic functions.

Regex

Regular expression library.

Smart Ptr

Smart pointer class templates.

Tuple

Ease definition of functions returning multiple values, and more.

Type Traits

Templates for fundamental properties of types.

Unordered

Unordered associative containers.

[https://cpppatterns.com/](https://cpppatterns.com/)
链接:[boost 参考文档目录翻译](https://bbs.huaweicloud.com/blogs/ca5214c8ea7f11e8bd5a7ca23e93a891)